content/posts/recipes.md
+++
title = "Recipes"
author = ["Jacob Chvatal"]
lastmod = 2020-08-01T23:17:57-07:00
slug = "recipes"
draft = false
+++

## Recipes {#recipes}


### <span class="org-todo todo NEXT">NEXT</span> Sloppy Joes {#sloppy-joes}

-   1 1/2 lbs lean ground beef
-   1 yellow onion
-   1 red bell pepper
-   Sea salt - to taste
-   black pepper - to taste
-   1 cup Ketchup
-   1/2 cup pureed sweet potatoes (you can buy canned and mash with fork or microwave a sweet potato and scoop out flesh to mash with fork) 
-   3 TBS apple cider Vinegar
-   3 TBS Worcestershire sauce
-   1 TBS brown sugar
-   3 TBS yellow mustard

Brown the beef in a nonstick skillet over medium heat, 5-7 minutes, drain fat.  Add onion and bell pepper and season with salt and pepper.  Cook until vegetables are soft, about 7 minutes.  Add ketchup, sweet potatoes, vinegar, Worcestershire sauce, sugar and mustard.  Stir to combine.  Simmer until slightly thickened, about 10 minutes.  If too thick, add water by the tablespoon as needed. Spoon over hamburger buns. 


### <span class="org-todo todo NEXT">NEXT</span> Baked salmon {#baked-salmon}

<https://www.fifteenspatulas.com/baked-salmon/>


### <span class="org-todo todo NEXT">NEXT</span> Chicken Fajitas {#chicken-fajitas}

<https://damndelicious.net/2019/07/24/sheet-pan-chicken-fajitas/>

Success!! Use extra lime and other spices and top with cilantro. Use more chicken than usual as well, the recipe is a bit light - 2 lbs is good


### Chicken Casserole (Lynn) {#chicken-casserole--lynn}

-   3-4 chicken breasts
-   2-10 3/4 oz cans Cream of Chicken soup
-   1 - 10 3/4 oz. can chicken broth
-   8 oz bag Pepperidge Farm Stuffing
-   1 stick butter
-   1 - 10 3/4 oz can mulk

-   Preheat to 375
-   boil chicken until done, then cube it
-   place chicken in large casserole dish
-   mix soup and brock with chicken, spread evenly over dish
-   moisten stuffing with butter, spread over chicken
-   pour the milk over everything
-   cook for 30 minutes covered, then 15 minutes uncovered


### Layered Hamburger Bake (GB) {#layered-hamburger-bake--gb}

-   3 cups medium noodles
-   1 lb ground beef
-   1 15oz can / 2 cups tomato sauce
-   1 t sugar
-   1/2 t salt
-   1/4 t garlic salt
-   1/8 t pepper
-   1 8oz package cream cheese, softened
-   3 T milk
-   1/2 cup sour cream
-   2 T finely chopped onion
-   1 10oz pkx frozen, chopped spinach or broccoli
-   1/2 C (2oz) natural shredded cheddar

-   Cook noodles in large amount of boiling salted water until tender,
    about 10 minutes, drain.
-   Cook noodles in large amount of boiling salted water until tender, about 10
    minutes, drain.
-   Add tomato sauce, sugar, salt, garlic salt pepper and cooked noodles. Set
    aside.
-   Stir together cream cheese, sour cream, milk and onion.
-   In 2QT. casserole, layer half of the ground beef-noodle mixture, half the
    cream cheese mixture, all of the spinach and rest of the ground beef
    mixture.
-   Cover and bake in 350 degree oven for 40 minutes ot till bubbly.
-   Uncover and spread remaining cream cheese mixture atop; sprinkle with cheddar
    cheese.

Note: As I said, I add a little more sour cream and milk to the cream cheese to
make it spread further and more easily.


### Baked Chicken Parmesean {#baked-chicken-parmesean}

Sauce:
1/4 cup extra virgin olive oil
2 garlic cloves, peeled, finely chopped (about 2 teaspoons)
1 can (28 oz) crushed tomatoes (we use Muir-Glen)
1/2 teaspoon dried basil (or 1 Tbsp of chopped fresh basil)
1/4 teaspoon dried oregano (or 1 teaspoon of chopped fresh oregano)
1/4 teaspoon sugar
Salt and ground black pepper to taste

Chicken:
3 Tbsp Dijon mustard
1 Tbsp white-wine vinegar
1/2 teaspoon salt
1/2 teaspoon black pepper
1 1/2 pounds chicken breast cutlets (or skinless boneless chicken breasts or
thighs that have been pounded to a 1/4-inch thickness)
1 cup of breadcrumbs (panko or homemade)
1 cup finely grated Parmesan cheese
3 Tbsp unsalted butter, melted

1 Make the sauce: Heat the olive oil in a large saucepan on medium high heat.
Add the garlic and cook until fragrant, about 30 seconds.

Stir in the crushed tomatoes, basil, oregano, sugar, a pinch of salt and pepper. Bring to a simmer.

Continue to simmer until sauce thickens a bit and flavors meld, about 10-12 minutes. Taste sauce, adjust seasoning if necessary, cover and keep warm.

2 Preheat oven to 450°F. Line a baking sheet with foil, parchment, or Silpat. While the sauce is simmering, prepare the chicken in the next steps.

3 Make the coating: In a large bowl whisk together the mustard, vinegar, salt, and 1/4 teaspoon of pepper.

Add the chicken cutlets to the mixture and coat well on both sides.

4 Dredge the chicken: In another bowl, mix together the breadcrumbs, grated Parmesan, and 1/4 teaspoon of black pepper. Mix well and stir in the melted butter. Transfer to a shallow plate.

Dredge the chicken pieces in the breadcrumb mixture, gently pressing the breadcrumbs into the chicken cutlets. Place dredged chicken on the lined baking sheet.

5 Bake: Bake at 450°F on the center rack of the oven until cooked and golden
brown, about 15 minutes.

6 Serve: Serve with a side of rice, noodles or pasta. Ladle sauce with the chicken.


### <https://tasty.co/recipe/one-pan-shrimp-and-green-bean-stir-fry> {#https-tasty-dot-co-recipe-one-pan-shrimp-and-green-bean-stir-fry}


### baguettes {#baguettes}

<https://www.kingarthurflour.com/recipes/classic-baguettes-recipe>


### apple cinnamon oatmeal {#apple-cinnamon-oatmeal}

<https://www.thereciperebel.com/apple-cinnamon-oatmeal/#wprm-recipe-container-12520>


### <https://tasty.co/recipe/marinara-meatballs> {#https-tasty-dot-co-recipe-marinara-meatballs}


### HEDULED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-01-12 Sun&gt;</span></span> {#heduled}


### <span class="org-todo todo NEXT">NEXT</span> <https://tasty.co/recipe/one-pan-roasted-chicken-and-sweet-potatoes> {#https-tasty-dot-co-recipe-one-pan-roasted-chicken-and-sweet-potatoes}


### HEDULED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-01-12 Sun&gt;</span></span> {#heduled}


### <span class="org-todo todo NEXT">NEXT</span> <https://sfist.com/2009/12/08/diy%5Fstarbucks%5Fpeppermint%5Fmocha/> {#https-sfist-dot-com-2009-12-08-diy-starbucks-peppermint-mocha}


### HEDULED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-01-18 Sat&gt;</span></span> {#heduled}


### <span class="org-todo todo NEXT">NEXT</span> <https://takingtimeformommy.com/chocolate-mint-clif-bars-homemade-protein-bar-recipe/> {#https-takingtimeformommy-dot-com-chocolate-mint-clif-bars-homemade-protein-bar-recipe}


### HEDULED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-01-18 Sat&gt;</span></span> {#heduled}


### <span class="org-todo todo NEXT">NEXT</span> <https://thebigmansworld.com/chewy-mint-chocolate-chip-protein-bars/> {#https-thebigmansworld-dot-com-chewy-mint-chocolate-chip-protein-bars}


### HEDULED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-01-18 Sat&gt;</span></span> {#heduled}


### <span class="org-todo todo NEXT">NEXT</span> <https://www.thereciperebel.com/apple-cinnamon-oatmeal/#wprm-recipe-container-12520> {#https-www-dot-thereciperebel-dot-com-apple-cinnamon-oatmeal-wprm-recipe-container-12520}


### HEDULED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-03-07 Sat&gt;</span></span> {#heduled}


### <span class="org-todo todo NEXT">NEXT</span> <https://www.kingarthurflour.com/recipes/panini-bread-recipe> {#https-www-dot-kingarthurflour-dot-com-recipes-panini-bread-recipe}


### HEDULED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-03-08 Sun&gt;</span></span> {#heduled}

<https://github.com/stamourv/recipes>


### pie crust {#pie-crust}

<https://www.jocooks.com/recipes/pie-crust-recipe/>


### panini bread {#panini-bread}

<https://www.kingarthurflour.com/recipes/panini-bread-recipe>


### baking without a loaf pan {#baking-without-a-loaf-pan}

<https://www.bakingkneads.com/baking-bread-without-a-loaf-pan/>


### apple dumplings {#apple-dumplings}

<https://www.jocooks.com/baking/pastries/apple-dumplings/>


### baguettes {#baguettes}

<https://www.kingarthurflour.com/blog/2011/07/14/baguettes-do-try-this-at-home>


## <span class="org-todo todo NEXT">NEXT</span> Homemade Soft Pretzels Recipe | Alton Brown | Food Network {#homemade-soft-pretzels-recipe-alton-brown-food-network}

Homemade Soft Pretzels Recipe | Alton Brown | Food Network
<https://www.foodnetwork.com/recipes/alton-brown/homemade-soft-pretzels-recipe-1948242>


## mmm {#mmm}

<https://www.allrecipes.com/recipe/17918/focaccia-bread/>
